// 5. 
// Користувач вводить три довжини сторін трикутника(використовуйте prompt() три рази для введення кожної сторони).
//     Необхідно 
//     a) визначити і вивести в консоль площу трикутника 
//     b) перевірити чи цей трикутник є прямокутним і вивести в консоль результат перевірки.
// Здійснювати перевірку чи введені користувачем значення коректні, в іншому випадку вивести
// 'Incorrect data‘. Результат обчислення площі трикутника виводити в консоль з точністю 
// 3 знаки після коми(наприклад: 8.42355465 => 8.424).

let a = +prompt("Введіть довжину сторони a:");
let b = +prompt("Введіть довжину сторони b:");
let c = +prompt("Введіть довжину сторони c:");

// перевірка чи введені користувачем значення коректні
if (isNaN(a) || isNaN(b) || isNaN(c) || a <= 0 || b <= 0 || c <= 0) {
    console.log("Incorrect data");
} else {
    let p = (a + b + c) / 2;
    let area = Math.sqrt(p * (p - a) * (p - b) * (p - c)).toFixed(3);
    console.log(`Площа трикутника дорівнює ${area}`);
    if (a * a + b * b === c * c || a * a + c * c === b * b || b * b + c * c === a * a) {
        console.log("Трикутник прямокутний");
    } else {
        console.log("Трикутник не прямокутний");
    }
}